PhasorCZ/CAN-SX/software/PSoC4/Bootloader_DoorController_CAN.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "CAN_RX.h"
#include "CAN_RX_aliases.h"
#include "CAN_TX.h"
#include "CAN_TX_aliases.h"
#include "CAN.h"
#include "CAN_EN.h"
#include "CAN_EN_aliases.h"
#include "CAN_ERR.h"
#include "CAN_ERR_aliases.h"
#include "CAN_STB.h"
#include "CAN_STB_aliases.h"
#include "DieTemp.h"
#include "PWM_DOWN_IN.h"
#include "PWM_DOWN_IN_aliases.h"
#include "PWM_UP_IN.h"
#include "PWM_UP_IN_aliases.h"
#include "HB_1_IN.h"
#include "HB_1_IN_aliases.h"
#include "EN_2.h"
#include "EN_2_aliases.h"
#include "EN_1.h"
#include "EN_1_aliases.h"
#include "DLS_UNLOCKING.h"
#include "DLS_UNLOCKING_aliases.h"
#include "DLS_LOCKING.h"
#include "DLS_LOCKING_aliases.h"
#include "PWM_DOWN.h"
#include "PWM_UP.h"
#include "PWM_MM.h"
#include "Clock_1.h"
#include "LED.h"
#include "LED_aliases.h"
#include "PWS_RIGHT_LOCK_UP_DEB.h"
#include "PWS_RIGHT_LOCK_UP_DEB_aliases.h"
#include "PWS_LEFT_AUTO_DEB.h"
#include "PWS_LEFT_AUTO_DEB_aliases.h"
#include "PWS_LEFT_UP_DEB.h"
#include "PWS_LEFT_UP_DEB_aliases.h"
#include "PWS_LEFT_DOWN_DEB.h"
#include "PWS_LEFT_DOWN_DEB_aliases.h"
#include "PWS_RIGHT_LOCK_DOWN_DEB.h"
#include "PWS_RIGHT_LOCK_DOWN_DEB_aliases.h"
#include "PWS_RIGHT_UP_DEB.h"
#include "PWS_RIGHT_UP_DEB_aliases.h"
#include "PWS_RIGHT_DOWN_DEB.h"
#include "PWS_RIGHT_DOWN_DEB_aliases.h"
#include "MM_IN.h"
#include "MM_IN_aliases.h"
#include "PWM_HB_1.h"
#include "PWM_DOWN_IS.h"
#include "PWM_DOWN_IS_aliases.h"
#include "PWM_UP_IS.h"
#include "PWM_UP_IS_aliases.h"
#include "SPI_IS.h"
#include "SPI_IS_aliases.h"
#include "HB_IS.h"
#include "HB_IS_aliases.h"
#include "EN_3.h"
#include "EN_3_aliases.h"
#include "DI_DEB.h"
#include "DI_DEB_aliases.h"
#include "DIO_4.h"
#include "DIO_4_aliases.h"
#include "AI_5.h"
#include "AI_5_aliases.h"
#include "Opamp_1.h"
#include "AI_6.h"
#include "AI_6_aliases.h"
#include "Opamp_2.h"
#include "PWM_HB_2.h"
#include "HB_2_IN.h"
#include "HB_2_IN_aliases.h"
#include "DIO_3.h"
#include "DIO_3_aliases.h"
#include "DIO_2.h"
#include "DIO_2_aliases.h"
#include "DIO_1.h"
#include "DIO_1_aliases.h"
#include "EN_4.h"
#include "EN_4_aliases.h"
#include "MM_DEN.h"
#include "MM_DEN_aliases.h"
#include "MM_EN.h"
#include "MM_EN_aliases.h"
#include "HB_2_EN.h"
#include "HB_2_EN_aliases.h"
#include "HB_1_EN.h"
#include "HB_1_EN_aliases.h"
#include "HB_1_DEN.h"
#include "HB_1_DEN_aliases.h"
#include "HB_2_DEN.h"
#include "HB_2_DEN_aliases.h"
#include "PWM_DOWN_INH.h"
#include "PWM_DOWN_INH_aliases.h"
#include "PWM_UP_INH.h"
#include "PWM_UP_INH_aliases.h"
#include "Bootloader.h"
#include "Bootloader_PVT.h"
#include "CAN_isr.h"
#include "CAN_HFCLK.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "core_cm0plus_psoc4.h"
#include "cy_em_eeprom.h"
#include "CyDMA.h"
#include "CyLFClk.h"

/*[]*/

